In [1]:
# Import necessary libraries
import pandas as pd

In [5]:
# Loading a csv file to a dataframe
df = pd.read_csv('./data/housing-price.csv') # Dataframe
print(df.head()) # Displaying first 5 rows of the dataframe

   Home   Price  SqFt  Bedrooms  Bathrooms  Offers Brick Neighborhood
0     1  114300  1790         2          2       2    No         East
1     2  114200  2030         4          2       3    No         East
2     3  114800  1740         3          2       1    No         East
3     4   94700  1980         3          2       3    No         East
4     5  119800  2130         3          3       3    No         East

In [7]:
# Now we are setting Home column as the default index
df = df.set_index('Home')

In [8]:
# We can see the home column becomes the default index column
print(df.head()) # Displaying the first 5 rows of the dataframe

       Price  SqFt  Bedrooms  Bathrooms  Offers Brick Neighborhood
Home
1     114300  1790         2          2       2    No         East
2     114200  2030         4          2       3    No         East
3     114800  1740         3          2       1    No         East
4      94700  1980         3          2       3    No         East
5     119800  2130         3          3       3    No         East

In [10]:
# Now saving the dataframe to a new csv file
df.to_csv('./data/new_csv_1.csv')

In [11]:
# Now loading the new csv file
df_2 = pd.read_csv('./data/new_csv_1.csv')
df_2.head()

   Home   Price  SqFt  Bedrooms  Bathrooms  Offers Brick Neighborhood
0     1  114300  1790         2          2       2    No         East
1     2  114200  2030         4          2       3    No         East
2     3  114800  1740         3          2       1    No         East
3     4   94700  1980         3          2       3    No         East
4     5  119800  2130         3          3       3    No         East

In [12]:
# we can notice that our csv file index is gone. This because csv file has no attribute called 'index' 
# but dataframe has index
df_2 = pd.read_csv('./data/new_csv_1.csv',index_col=0)
print(df_2.head())

       Price  SqFt  Bedrooms  Bathrooms  Offers Brick Neighborhood
Home
1     114300  1790         2          2       2    No         East
2     114200  2030         4          2       3    No         East
3     114800  1740         3          2       1    No         East
4      94700  1980         3          2       3    No         East
5     119800  2130         3          3       3    No         East

In [17]:
# If you wish to sent only one column to the new csv file
df['Price'].to_csv('./data/new_csv_2.csv')

In [18]:
# we can notice that our csv file index is gone. This because csv file has no attribute called 'index' 
# but dataframe has index
df_3 = pd.read_csv('./data/new_csv_2.csv',index_col=0)
print(df_3.head())

   114300
1
2  114200
3  114800
4   94700
5  119800
6  114600

In [19]:
df.head() # 1st dataframe

       Price  SqFt  Bedrooms  Bathrooms  Offers Brick Neighborhood
Home
1     114300  1790         2          2       2    No         East
2     114200  2030         4          2       3    No         East
3     114800  1740         3          2       1    No         East
4      94700  1980         3          2       3    No         East
5     119800  2130         3          3       3    No         East

In [20]:
# Renaming column names in the dataframe
# Syntax: df.rename(columns={'oldname1':'newname1','oldname2':'newname2'})
df = df.rename(columns = {'Price':'House_Prices','Offers':'Benefits'})

In [21]:
df.head()

      House_Prices  SqFt  Bedrooms  Bathrooms  Benefits Brick Neighborhood
Home
1           114300  1790         2          2         2    No         East
2           114200  2030         4          2         3    No         East
3           114800  1740         3          2         1    No         East
4            94700  1980         3          2         3    No         East
5           119800  2130         3          3         3    No         East

In [ ]:
# new_csv2 file has no headers

In [32]:
df_4 = pd.read_csv('./data/new_csv_2.csv',names=['House Prices'],index_col=0)

In [33]:
df_4.head()

   House Prices
1        114300
2        114200
3        114800
4         94700
5        119800

In [34]:
# If you want to display the data to HTML in your website
# We can export it to html
df.to_html('./data/example.html')